In [2]:
import pandas as pd

In [3]:
series = pd.Series(["BMW","Toyota","Honda"])

### Series = 1-dimensional

In [4]:
colours = pd.Series(["red","blue","white"])
colours

0      red
1     blue
2    white
dtype: object

### DataFrame = 2-dimensional

In [5]:
car_data = pd.DataFrame({"Car make":series,"Colour":colours})
car_data

  Car make Colour
0      BMW    red
1   Toyota   blue
2    Honda  white

In [6]:
# import data
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
# exporting a data frame
car_sales.to_csv("exported-car-sales.csv",index=False)

## Describe data

In [10]:
# Attribute - 
car_sales.dtypes

# Function
# car_sales.to_csv("exported-car-sales.csv",index=False)

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [13]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [16]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [17]:
car_sales.mean()

C:\Users\dimai\AppData\Local\Temp\ipykernel_8500\4073448239.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [19]:
car_prices = pd.Series([3000,1500,111250])
car_prices.mean()

38583.333333333336

In [20]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [22]:
car_sales["Doors"].sum()

40

In [23]:
len(car_sales)

10

## Practice

In [25]:
favorites = pd.Series(["orange","apple","potato"])
words = pd.Series(["hello","world"])

obj = pd.DataFrame({"favs":favorites,"wors":words})
obj

     favs   wors
0  orange  hello
1   apple  world
2  potato    NaN

In [26]:
obj.describe()

          favs   wors
count        3      2
unique       3      2
top     orange  hello
freq         1      1